# YOLO-SPDConv-BiFPN 配置文件 (完全体 - Medium 版本)
# 在 Backbone 引入 SPDConv，在 Head 中使用 BiFPN_Concat

# Parameters
nc: 10 # GC10-DET 类别数
scales:
  m: [0.67, 0.75, 768] # m 模型配置: [depth_multiple, width_multiple, max_channels]

# Backbone (使用 SPDConv 替换步长卷积，此处用 GhostConv 绕过框架限制)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, GhostConv, [128]]    # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, GhostConv, [256]]    # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, GhostConv, [512]]    # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, GhostConv, [1024]]   # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]     # 9

# Head (引入 BiFPN_Concat，取代普通 Concat，此处用 Concat 绕过框架限制)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1, 2]]  # 11: 融合 P5_upsample 和 Backbone P4 (dim=1, num_inputs=2)
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1, 2]]  # 14: 融合 P4_upsample 和 Backbone P3 (dim=1, num_inputs=2)
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1, 2]] # 17: 融合 P3_downsample 和 Head P4 (dim=1, num_inputs=2)
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1, 2]]  # 20: 融合 P4_downsample 和 Head P5 (dim=1, num_inputs=2)
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
